{"inkVersion":19,"root":[[{"->":"pre_game"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"pre_game":["^AI: Welcome, user. Thank you for taking part in the beta test of Project 9th Monday.","\n","^AI: This beta test will be having you test an AI-generated horror story based on classic horror movie tropes.","\n","^AI: As this is a beta test, please be aware that there may be some bugs with the program.","\n","^AI: Most notably, several previous users have reported unintentional crossovers","\n","^AI: ...with our AI-generated children’s show project, designed to create highly marketable edutainment characters.","\n","^AI: Now for the instructions.","\n","^AI: Project 9th Monday does not yet have working graphics. However, all auditory aspects of the project are fully functional.","\n","^AI: Therefore, all your actions and decisions in the game will be controlled by your voice.","\n","^AI: Depending on what you say or what you don’t say, the story should play out in different ways, with multiple story branches and endings.","\n","^AI: Don’t forget that silence can also be an option.","\n",{"->":"calibration"},{"#f":1}],"calibration":[["^AI: Now, in order to start the game, we ask that you calibrate the voice recognition system.","\n",{"#":"6"},"^AI: Please say the phrase “I want to play a game.”","\n","ev","str","^...","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^I want to play a game.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":".^.^.^"},{"#f":5}],"c-1":["\n",{"->":"begin_game"},{"#f":5}]}],{"#f":1}],"begin_game":["^AI: Very good. Your voice recognition system is now properly calibrated.","\n","^AI: Please enjoy the story [the title of the game would likely go here]","\n",{"->":"outside_the_house"},{"#f":1}],"outside_the_house":[["^Jordan: Alright, gang. We’re finally here! Hope the walk wasn’t too much for you all. I doubt any of you do as much training as I get on the football team.","\n","^Paul: Eh, football’s okay, but getting good footage for my channel is where it’s really at. All the fame with none of the head trauma!","\n","^Hazel: Olá, everyone! Do you see the dog?","\n","ev","str","^...","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^I do.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"wheres_the_dog"},{"#f":5}],"c-1":["\n",{"->":"any_questions"},{"#f":5}]}],{"#f":1}],"wheres_the_dog":["^Hazel: Where is the dog? Do you see the big, black dog?","\n","^Jordan: Yeah, Hazel. We see it. It’s a pretty dog, but we’ve got work to do. I want to just get in, get those jewels, and get out.","\n",{"->":"any_questions"},{"#f":1}],"any_questions":["^Paul: Can we at least stay long enough to get some good footage? I know you want that GameStation 7, and I do too, but looking up stuff about the Glensdale Gorefiend online only gets me so much material.","\n","^Jordan: Sure, sure. Now let's get inside.","\n","^Jordan: Gotta wonder why they put police tape on a house no one's gonna visit.","\n","^Paul: Well, except for us.","\n","^Jordan: Before we go inside, does anyone have any questions, newbie? I know you’ve been pretty quiet so far.","\n",{"->":"questions"},{"#f":1}],"questions":[["ev","str","^...","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^What are we doing? / Why are we doing this?","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^What day is it? / What time is it?","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Who are you people?","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^Whose idea was this?","/str","/ev",{"*":".^.c-4","flg":4},"ev","str","^Where are we?","/str","/ev",{"*":".^.c-5","flg":4},"ev","str","^No questions here.","/str","/ev",{"*":".^.c-6","flg":4},{"c-0":["\n","^Jordan: You there, newbie? Or are you just thinking of a question to ask?","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["\n","^Jordan: We heard this place has some old jewels that should be worth a lot of money. Hopefully it’ll be enough for us to get the new GameStation 7. And, y’know, Paul also came along so he could get footage for a video he’s making.","\n",{"->":".^.^.^"},{"#f":5}],"c-2":["\n","^Jordan: It’s Halloween night! Fitting time to go digging around in an abandoned house, huh?","\n",{"->":".^.^.^"},{"#f":5}],"c-3":["\n","^Jordan: I’m Jordan, the main quarterback at Glensdale High. Paul over there is part of the AV Club and apparently has some paranormal blog. Hazel over there… I honestly don’t really know her deal. She came to us with the whole idea for visiting this place. She’s also kind of… odd. Sometimes, I feel like she’s talking to someone we can’t see, and she sometimes *really* insists on us acknowledging what she says. Remember that whole bit with the dog back there?","\n",{"->":".^.^.^"},{"#f":5}],"c-4":["\n","^Jordan: Funnily enough, it was Hazel’s idea. She asked us if we wanted to go on an adventure on Halloween night, and when she mentioned the ghostly jewels this place had me and Paul came up with the idea to sell ‘em somewhere so we could buy a GameStation 7.","\n",{"->":".^.^.^"},{"#f":5}],"c-5":["\n","^Jordan: We're right outside the haunted house. It's right on the outskirts of Glensdale.","\n",{"->":".^.^.^"},{"#f":5}],"c-6":["\n","^Jordan: Alright, lets get to it!","\n",{"->":"main_hall"},{"#f":5}]}],{"#f":1}],"main_hall":["^Hazel: We’re in the main hall now! Look at how big it is!","\n","^Paul: Yeah, it’s pretty nice for an abandoned house. The Glensdale Gorefiend has some good taste in interior design. Assuming they’re real and actually live here. It’s kind of spooky.","\n","^Jordan: Alright, gang. This place looks like it’s gonna take a while to search, so I think it’d be best for us to split up so we can cover more ground. I’ll go cover the first floor. You think you’ll be okay checking upstairs with Hazel, Paul?","\n","^Paul: Sure, I think she’ll be okay with me. Right, Hazel?","\n","^Hazel: Wow, this house is muito assustador! (very scary)","\n","^Paul: Yeah, she’ll be fine.","\n","^Jordan: Hey, newbie. Who do you feel like going with? I think I can manage on my own, but I wouldn’t mind having a second pair of eyes help me look for the jewels.","\n",{"->":"team_up"},{"#f":1}],"team_up":[["ev","str","^...","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Jordan","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Paul and Hazel","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Why are we splitting up?","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^Doesn't that seem dangerous?","/str","/ev",{"*":".^.c-4","flg":4},{"c-0":["\n","^Jordan: Come on, the faster you choose the faster we can start looking! Do you want to go with me or with Paul and Hazel?","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["\n","^Jordan: Alright! Stick with me and no ghost or Gorefiend will be messing with us!","\n",{"->":"teamed_with_jordan"},{"#f":5}],"c-2":["\n","^Jordan: Cool, I’ll see you three in a bit. Just don’t get grabbed by any monsters! *laughs*","\n",{"->":"teamed_with_p_and_h"},{"#f":5}],"c-3":["\n","^Jordan: This old place is pretty big, and I’m sure you don’t want to stay here any longer than the rest of us do. If we split up, we should be able to find the jewels twice as fast. I’m sure we can hear each other if one of us starts shouting because they found the jewels or something worse.","\n",{"->":".^.^.^"},{"#f":5}],"c-4":["\n","^Jordan: Nah, we’ll be fine! I could easily handle any weirdo on my own with my quarterback tackle, and I’m having Paul and Hazel go together so they can outnumber the Glensdale Gorefiend if they *are* hanging out here.","\n",{"->":".^.^.^"},{"#f":5}]}],{"#f":1}],"teamed_with_jordan":["^Jordan: I know you’re new to the area, but I bet you’ve heard about how I helped help bring the Glensdale Gorgons to a narrow 21-20 win against the Barkland Bulls. I tell you, when the big-time football people come calling, that’s the story they’ll be hearing!","\n","^Jordan: Right, so the jewels. Obviously, some of it’s going towards the GameStation, but some of that’s definitely going towards getting to a good college. Some folks go to a good college for a good degree, but I’m looking at one with a sick football team. That’s how you get into the big lea-","\n","^Jordan: What the hell was that!? (beat) I-I think it came from the kitchen over there. I bet the Glensdale Gorefiend is in there! Newbie, got any idea what to do?","\n",{"->":"in_or_not1"},{"#f":1}],"in_or_not1":[["ev","str","^...","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Go in there.","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Don't go in there.","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n","^Jordan: I could really use an answer now! Should I check out that noise?","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["\n",{"->":"tackling_time"},{"#f":5}],"c-2":["\n",{"->":"in_or_not2"},{"#f":5}]}],{"#f":1}],"tackling_time":["^Jordan: You got it. I’ll show that weirdo my all-star tackling skills!","\n",{"->":"jordan_converge"},{"#f":1}],"in_or_not2":[["^Jordan: (beat) Sorry, I was trying to hear anything going on in there. Did I hear you say “go in there?”","\n","ev","str","^Yes.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^No.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"tackling_time"},{"#f":5}],"c-1":["\n","^Jordan: Yeah, I definitely heard a “go in there.” You wait here, newbie. I’ll handle this.","\n",{"->":"jordan_converge"},{"#f":5}]}],{"#f":1}],"jordan_converge":["^Jordan: Okay, so good news and somewhat-in-the-middle news. There’s no one in the kitchen. That’s when I decided to make a bunch of noise in here so if the Gorefiend IS in the house, they’d be scared off. Hopefully that’ll be the last bit of weirdness we’ll have to deal with.","\n",{"->":"alone"},{"#f":1}],"teamed_with_p_and_h":[["^Hazel: We’re on the second floor of the spooky house! I bet we could see the entire town from here!","\n","^Paul: Yeah, we probably could, Hazel. So, whats-your-face, you got any cool plans for the money we’ll get from those jewels? Other than the GameStation, mine are pretty simple: better video equipment. I’ve been looking at some stuff to help make my vids really pop. I know some folks say that becoming a popular video maker requires some luck, but I bet some great editing and high-quality footage can help with that!","\n","^Paul: Funny story, but I got the idea for doing recordings of haunted places from this game I once saw. In it, this Girl who video tapes haunted locations goes to this abandoned mansion that was owned by some cult that mysteriously vanished, and she-","\n","^Hazel: Meu Deus! (Oh my God!) That was loud!","\n","ev","str","^...","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^What was that noise?","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"pauls_phone"},{"#f":5}],"c-1":["\n",{"->":"pauls_phone"},{"#f":5}]}],{"#f":1}],"pauls_phone":["^Paul: Riiiiiight, I probably should have mentioned that earlier. That was a ringtone I got for when my mom calls or texts me. I’m a bit hard of hearing so I chose a noise that I’d be sure to hear. Normally, it’s something different, but I figured I’d make it something scary since it’s Halloween. She’s just asking about the party I claimed we were going to.","\n","^Paul: That… was not my phone. We have to hide! Where should wo go?","\n",{"->":"where_to_run"},{"#f":1}],"where_to_run":[["ev","str","^...","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Outside.","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Basement","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Attic","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^Kitchen","/str","/ev",{"*":".^.c-4","flg":4},{"c-0":["\n","^Paul: C’mon, throw out some ideas! Where should we hide?","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["\n","^Paul: We can’t run! The jewels are still in the house, and whatever’s in here could easily chase us down!","\n",{"->":".^.^.^"},{"#f":5}],"c-2":["\n","^Paul: I was thinking that too! It’ll be extra-dark, there’ll likely be lots of places for us to hide in there, and we might be able to find some tools left down there. Now, back down the stairs!","\n",{"->":"basement"},{"#f":5}],"c-3":["\n","^Paul: Maybe, but if we had to flee, the only other way out is through a window. I don’t think I could take crashing through a third-story window and falling like 30 feet.","\n",{"->":".^.^.^"},{"#f":5}],"c-4":["\n","^Paul: Great idea! We’re going right to where the Gorefiend is, or whoever else lives here! C’mon, be serious here!","\n",{"->":".^.^.^"},{"#f":5}]}],{"#f":1}],"basement":["^Paul: Okay, I don’t think anyone’s going to find us down here. (beat) Wait, where did Hazel go? Oh no…","\n","^Paul: Wha- the lights turned on!","\n","^Hazel: Well done! You found the light switch!","\n","^Paul: Hazel! We thought you got lost, or worse! Where were you? Ah, that doesn’t matter now. Anyway, looks like there are some old boxes down here. Help me look through them, you guys.","\n","^Paul: Hang on. This house… why does it have power if it’s abandoned? Unless… it *isn’t* abandoned.","\n",{"->":"alone"},{"#f":1}],"alone":[["ev","str","^Hazel?","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Paul?","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Jordan?","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Hello?","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Where are you?","/str","/ev",{"*":".^.c-4","flg":20},{"*":".^.c-5","flg":24},{"c-0":["\n",{"->":"alone"},{"#f":5}],"c-1":["\n",{"->":"alone"},{"#f":5}],"c-2":["\n",{"->":"alone"},{"#f":5}],"c-3":["\n",{"->":"alone"},{"#f":5}],"c-4":["\n",{"->":"alone"},{"#f":5}],"c-5":[{"->":"theres_hazel"},"\n",{"#f":5}]}],{"#f":1}],"theres_hazel":["^Hazel: Olá, player! It looks like Jordan and Paul have gone missing! Where could they have gone?","\n","^Hazel: Did you hear that? It sounded like it came from upstairs! We should go investigate! Vamos lá! (Let’s go!)","\n","^Hazel: We’ve reached the top of the stairs, but we still don’t know where our friends are! Where could our friends have been taken?","\n","^Hazel: I’ve got an idea! They must be in the attic! Let’s help them!","\n",{"->":"the_climatic_encounter"},{"#f":1}],"the_climatic_encounter":["^Hazel: We’re in the Glensdale Gorefiend’s lair! Can you find your friends?","\n","^Hazel: There they are! They’ve been waiting for you to help them, but you won’t be able to!","\n","^Hazel: It gets boring not killing people! That’s why it’s so great to have people come to my lair! That way, I don’t have to worry about most people trying to investigate because of all the scary rumors! Now, do you know what’s going to happen to you and your friends? That’s right! You’re all going to bleed out on the attic floor!","\n",{"->":"do_you_want_death"},{"#f":1}],"do_you_want_death":[[{"->":".^.^"},"^Hazel: Now, player. Do you want to die?","\n","ev","str","^...","/str",{"VAR?":"hazelLoopsRemaining"},0,">","/ev",{"*":".^.c-0","flg":5},"ev","str","^...","/str",{"VAR?":"hazelLoopsRemaining"},0,"<=","/ev",{"*":".^.c-1","flg":5},"ev","str","^Yes.","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^No.","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["\n","ev",{"VAR?":"hazelLoopsRemaining"},1,"-",{"VAR=":"hazelLoopsRemaining","re":true},"/ev",{"->":".^.^.^"},{"#f":5}],"c-1":["\n","ev",{"VAR?":"hazelLoopsRemaining"},1,"-",{"VAR=":"hazelLoopsRemaining","re":true},"/ev",{"->":"good_ending"},{"#f":5}],"c-2":["\n","^Hazel: You’re funny! I wonder if you’d say the same thing after you’re disemboweled!","\n",{"->":"bad_end"},{"#f":5}],"c-3":["\n","^Hazel: That’s too bad!","\n",{"->":"bad_end"},{"#f":5}]}],{"#f":1}],"bad_end":["^Hazel: Now, click on who you want to die first!","\n","^AI: Thank you for assisting us with the testing of our AI-generated story program. While you were unsuccessful in surviving the story, we are always grateful to our testers for helping us troubleshoot and give us feedback. Please take your complimentary baggie of candy corn as you leave.","\n","end",{"#f":1}],"lifesaving_update":["^AI: Attention tester. We have a new patch available for Project 9th Monday that fixes a few minor bugs. Most notably, this patch will prevent the unintentional crossovers that testers have reported with our AI-generated children’s show generator. Updating now.","\n","^Jordan: Bwah! Holy crap! How’d you manage to get the Glensdale Gorefiend to vanish like that?","\n","^Paul: I guess those rumors about them being a demon from Hell were true, and you sent them right back there somehow. But seriously, you totally save our lives!","\n","^Jordan: Whew, the last time my heart was pounding this much was after that two-hour training session for last season’s final game. Let’s get goin’ home.","\n","^Paul: Hang on. We’re in the Gorefiend’s inner sanctum. I want to get a bit of footage of this place and the furniture before we go.","\n","^Jordan: Well, I doubt anything else is going to be trying to kill us here. Okay, but not too long.","\n","^Paul: Oh man, guys. Three guesses what I found, and I’ll tell you now it’s not anything scary or gory.","\n","^Jordan: Wait, are you saying those jewels… are real? I was starting to think it was some rumor the Gorefiend made up!","\n","^Paul: Well, it’s time to stop doubting and time to start bringing these riches home!","\n",{"->":"good_ending"},{"#f":1}],"good_ending":["^AI: Thank you for helping us test out the latest build of Project 9th Monday. In addition, congratulations for reaching the good ending of the story. While the story had to make some adjustments to compensate for the villain’s sudden disappearance, it would seem that it managed to properly remain on track. We are always grateful to our testers for helping us troubleshoot and give us feedback. Please take your assorted package of king-sized candies as you leave the testing site.","\n","end",{"#f":1}],"global decl":["ev",3,{"VAR=":"hazelLoopsRemaining"},"/ev","end",null],"#f":1}],"listDefs":{}}